/* -------------------------------------------------------------------

                  ⚡ Storm Software - Shell Shock

 This code was released as part of the Shell Shock project. Shell Shock
 is maintained by Storm Software under the Apache-2.0 license, and is
 free for commercial and private use. For more information, please visit
 our licensing page at https://stormsoftware.com/licenses/projects/shell-shock.

 Website:                  https://stormsoftware.com
 Repository:               https://github.com/storm-software/shell-shock
 Documentation:            https://docs.stormsoftware.com/projects/shell-shock
 Contact:                  https://stormsoftware.com/contact

 SPDX-License-Identifier:  Apache-2.0

 ------------------------------------------------------------------- */

export const spinners = {
  dots: {
    interval: 80,
    frames: ["⠋", "⠙", "⠹", "⠸", "⠼", "⠴", "⠦", "⠧", "⠇", "⠏"]
  },
  dots2: {
    interval: 80,
    frames: ["⣾", "⣽", "⣻", "⢿", "⡿", "⣟", "⣯", "⣷"]
  },
  dots3: {
    interval: 80,
    frames: ["⠋", "⠙", "⠚", "⠞", "⠖", "⠦", "⠴", "⠲", "⠳", "⠓"]
  },
  dots4: {
    interval: 80,
    frames: [
      "⠄",
      "⠆",
      "⠇",
      "⠋",
      "⠙",
      "⠸",
      "⠰",
      "⠠",
      "⠰",
      "⠸",
      "⠙",
      "⠋",
      "⠇",
      "⠆"
    ]
  },
  dots5: {
    interval: 80,
    frames: [
      "⠋",
      "⠙",
      "⠚",
      "⠒",
      "⠂",
      "⠂",
      "⠒",
      "⠲",
      "⠴",
      "⠦",
      "⠖",
      "⠒",
      "⠐",
      "⠐",
      "⠒",
      "⠓",
      "⠋"
    ]
  },
  dots6: {
    interval: 80,
    frames: [
      "⠁",
      "⠉",
      "⠙",
      "⠚",
      "⠒",
      "⠂",
      "⠂",
      "⠒",
      "⠲",
      "⠴",
      "⠤",
      "⠄",
      "⠄",
      "⠤",
      "⠴",
      "⠲",
      "⠒",
      "⠂",
      "⠂",
      "⠒",
      "⠚",
      "⠙",
      "⠉",
      "⠁"
    ]
  },
  dots7: {
    interval: 80,
    frames: [
      "⠈",
      "⠉",
      "⠋",
      "⠓",
      "⠒",
      "⠐",
      "⠐",
      "⠒",
      "⠖",
      "⠦",
      "⠤",
      "⠠",
      "⠠",
      "⠤",
      "⠦",
      "⠖",
      "⠒",
      "⠐",
      "⠐",
      "⠒",
      "⠓",
      "⠋",
      "⠉",
      "⠈"
    ]
  },
  dots8: {
    interval: 80,
    frames: [
      "⠁",
      "⠁",
      "⠉",
      "⠙",
      "⠚",
      "⠒",
      "⠂",
      "⠂",
      "⠒",
      "⠲",
      "⠴",
      "⠤",
      "⠄",
      "⠄",
      "⠤",
      "⠠",
      "⠠",
      "⠤",
      "⠦",
      "⠖",
      "⠒",
      "⠐",
      "⠐",
      "⠒",
      "⠓",
      "⠋",
      "⠉",
      "⠈",
      "⠈"
    ]
  },
  dots9: {
    interval: 80,
    frames: ["⢹", "⢺", "⢼", "⣸", "⣇", "⡧", "⡗", "⡏"]
  },
  dots10: {
    interval: 80,
    frames: ["⢄", "⢂", "⢁", "⡁", "⡈", "⡐", "⡠"]
  },
  dots11: {
    interval: 100,
    frames: ["⠁", "⠂", "⠄", "⡀", "⢀", "⠠", "⠐", "⠈"]
  },
  dots12: {
    interval: 80,
    frames: [
      "⢀⠀",
      "⡀⠀",
      "⠄⠀",
      "⢂⠀",
      "⡂⠀",
      "⠅⠀",
      "⢃⠀",
      "⡃⠀",
      "⠍⠀",
      "⢋⠀",
      "⡋⠀",
      "⠍⠁",
      "⢋⠁",
      "⡋⠁",
      "⠍⠉",
      "⠋⠉",
      "⠋⠉",
      "⠉⠙",
      "⠉⠙",
      "⠉⠩",
      "⠈⢙",
      "⠈⡙",
      "⢈⠩",
      "⡀⢙",
      "⠄⡙",
      "⢂⠩",
      "⡂⢘",
      "⠅⡘",
      "⢃⠨",
      "⡃⢐",
      "⠍⡐",
      "⢋⠠",
      "⡋⢀",
      "⠍⡁",
      "⢋⠁",
      "⡋⠁",
      "⠍⠉",
      "⠋⠉",
      "⠋⠉",
      "⠉⠙",
      "⠉⠙",
      "⠉⠩",
      "⠈⢙",
      "⠈⡙",
      "⠈⠩",
      "⠀⢙",
      "⠀⡙",
      "⠀⠩",
      "⠀⢘",
      "⠀⡘",
      "⠀⠨",
      "⠀⢐",
      "⠀⡐",
      "⠀⠠",
      "⠀⢀",
      "⠀⡀"
    ]
  },
  dots13: {
    interval: 80,
    frames: ["⣼", "⣹", "⢻", "⠿", "⡟", "⣏", "⣧", "⣶"]
  },
  dots14: {
    interval: 80,
    frames: [
      "⠉⠉",
      "⠈⠙",
      "⠀⠹",
      "⠀⢸",
      "⠀⣰",
      "⢀⣠",
      "⣀⣀",
      "⣄⡀",
      "⣆⠀",
      "⡇⠀",
      "⠏⠀",
      "⠋⠁"
    ]
  },
  dots8Bit: {
    interval: 80,
    frames: [
      "⠀",
      "⠁",
      "⠂",
      "⠃",
      "⠄",
      "⠅",
      "⠆",
      "⠇",
      "⡀",
      "⡁",
      "⡂",
      "⡃",
      "⡄",
      "⡅",
      "⡆",
      "⡇",
      "⠈",
      "⠉",
      "⠊",
      "⠋",
      "⠌",
      "⠍",
      "⠎",
      "⠏",
      "⡈",
      "⡉",
      "⡊",
      "⡋",
      "⡌",
      "⡍",
      "⡎",
      "⡏",
      "⠐",
      "⠑",
      "⠒",
      "⠓",
      "⠔",
      "⠕",
      "⠖",
      "⠗",
      "⡐",
      "⡑",
      "⡒",
      "⡓",
      "⡔",
      "⡕",
      "⡖",
      "⡗",
      "⠘",
      "⠙",
      "⠚",
      "⠛",
      "⠜",
      "⠝",
      "⠞",
      "⠟",
      "⡘",
      "⡙",
      "⡚",
      "⡛",
      "⡜",
      "⡝",
      "⡞",
      "⡟",
      "⠠",
      "⠡",
      "⠢",
      "⠣",
      "⠤",
      "⠥",
      "⠦",
      "⠧",
      "⡠",
      "⡡",
      "⡢",
      "⡣",
      "⡤",
      "⡥",
      "⡦",
      "⡧",
      "⠨",
      "⠩",
      "⠪",
      "⠫",
      "⠬",
      "⠭",
      "⠮",
      "⠯",
      "⡨",
      "⡩",
      "⡪",
      "⡫",
      "⡬",
      "⡭",
      "⡮",
      "⡯",
      "⠰",
      "⠱",
      "⠲",
      "⠳",
      "⠴",
      "⠵",
      "⠶",
      "⠷",
      "⡰",
      "⡱",
      "⡲",
      "⡳",
      "⡴",
      "⡵",
      "⡶",
      "⡷",
      "⠸",
      "⠹",
      "⠺",
      "⠻",
      "⠼",
      "⠽",
      "⠾",
      "⠿",
      "⡸",
      "⡹",
      "⡺",
      "⡻",
      "⡼",
      "⡽",
      "⡾",
      "⡿",
      "⢀",
      "⢁",
      "⢂",
      "⢃",
      "⢄",
      "⢅",
      "⢆",
      "⢇",
      "⣀",
      "⣁",
      "⣂",
      "⣃",
      "⣄",
      "⣅",
      "⣆",
      "⣇",
      "⢈",
      "⢉",
      "⢊",
      "⢋",
      "⢌",
      "⢍",
      "⢎",
      "⢏",
      "⣈",
      "⣉",
      "⣊",
      "⣋",
      "⣌",
      "⣍",
      "⣎",
      "⣏",
      "⢐",
      "⢑",
      "⢒",
      "⢓",
      "⢔",
      "⢕",
      "⢖",
      "⢗",
      "⣐",
      "⣑",
      "⣒",
      "⣓",
      "⣔",
      "⣕",
      "⣖",
      "⣗",
      "⢘",
      "⢙",
      "⢚",
      "⢛",
      "⢜",
      "⢝",
      "⢞",
      "⢟",
      "⣘",
      "⣙",
      "⣚",
      "⣛",
      "⣜",
      "⣝",
      "⣞",
      "⣟",
      "⢠",
      "⢡",
      "⢢",
      "⢣",
      "⢤",
      "⢥",
      "⢦",
      "⢧",
      "⣠",
      "⣡",
      "⣢",
      "⣣",
      "⣤",
      "⣥",
      "⣦",
      "⣧",
      "⢨",
      "⢩",
      "⢪",
      "⢫",
      "⢬",
      "⢭",
      "⢮",
      "⢯",
      "⣨",
      "⣩",
      "⣪",
      "⣫",
      "⣬",
      "⣭",
      "⣮",
      "⣯",
      "⢰",
      "⢱",
      "⢲",
      "⢳",
      "⢴",
      "⢵",
      "⢶",
      "⢷",
      "⣰",
      "⣱",
      "⣲",
      "⣳",
      "⣴",
      "⣵",
      "⣶",
      "⣷",
      "⢸",
      "⢹",
      "⢺",
      "⢻",
      "⢼",
      "⢽",
      "⢾",
      "⢿",
      "⣸",
      "⣹",
      "⣺",
      "⣻",
      "⣼",
      "⣽",
      "⣾",
      "⣿"
    ]
  },
  dotsCircle: {
    interval: 80,
    frames: ["⢎ ", "⠎⠁", "⠊⠑", "⠈⠱", " ⡱", "⢀⡰", "⢄⡠", "⢆⡀"]
  },
  sand: {
    interval: 80,
    frames: [
      "⠁",
      "⠂",
      "⠄",
      "⡀",
      "⡈",
      "⡐",
      "⡠",
      "⣀",
      "⣁",
      "⣂",
      "⣄",
      "⣌",
      "⣔",
      "⣤",
      "⣥",
      "⣦",
      "⣮",
      "⣶",
      "⣷",
      "⣿",
      "⡿",
      "⠿",
      "⢟",
      "⠟",
      "⡛",
      "⠛",
      "⠫",
      "⢋",
      "⠋",
      "⠍",
      "⡉",
      "⠉",
      "⠑",
      "⠡",
      "⢁"
    ]
  },
  line: { interval: 130, frames: ["-", "\\", "|", "/"] },
  line2: { interval: 100, frames: ["⠂", "-", "–", "—", "–", "-"] },
  rollingLine: {
    interval: 80,
    frames: ["/  ", " - ", " \\ ", "  |", "  |", " \\ ", " - ", "/  "]
  },
  pipe: { interval: 100, frames: ["┤", "┘", "┴", "└", "├", "┌", "┬", "┐"] },
  simpleDots: { interval: 400, frames: [".  ", ".. ", "...", "   "] },
  simpleDotsScrolling: {
    interval: 200,
    frames: [".  ", ".. ", "...", " ..", "  .", "   "]
  },
  star: { interval: 70, frames: ["✶", "✸", "✹", "✺", "✹", "✷"] },
  star2: { interval: 80, frames: ["+", "x", "*"] },
  flip: {
    interval: 70,
    frames: ["_", "_", "_", "-", "`", "`", "'", "´", "-", "_", "_", "_"]
  },
  hamburger: { interval: 100, frames: ["☱", "☲", "☴"] },
  growVertical: {
    interval: 120,
    frames: ["▁", "▃", "▄", "▅", "▆", "▇", "▆", "▅", "▄", "▃"]
  },
  growHorizontal: {
    interval: 120,
    frames: ["▏", "▎", "▍", "▌", "▋", "▊", "▉", "▊", "▋", "▌", "▍", "▎"]
  },
  balloon: { interval: 140, frames: [" ", ".", "o", "O", "@", "*", " "] },
  balloon2: { interval: 120, frames: [".", "o", "O", "°", "O", "o", "."] },
  noise: { interval: 100, frames: ["▓", "▒", "░"] },
  bounce: { interval: 120, frames: ["⠁", "⠂", "⠄", "⠂"] },
  boxBounce: { interval: 120, frames: ["▖", "▘", "▝", "▗"] },
  boxBounce2: { interval: 100, frames: ["▌", "▀", "▐", "▄"] },
  triangle: { interval: 50, frames: ["◢", "◣", "◤", "◥"] },
  binary: {
    interval: 80,
    frames: [
      "010010",
      "001100",
      "100101",
      "111010",
      "111101",
      "010111",
      "101011",
      "111000",
      "110011",
      "110101"
    ]
  },
  arc: { interval: 100, frames: ["◜", "◠", "◝", "◞", "◡", "◟"] },
  circle: { interval: 120, frames: ["◡", "⊙", "◠"] },
  squareCorners: { interval: 180, frames: ["◰", "◳", "◲", "◱"] },
  circleQuarters: { interval: 120, frames: ["◴", "◷", "◶", "◵"] },
  circleHalves: { interval: 50, frames: ["◐", "◓", "◑", "◒"] },
  squish: { interval: 100, frames: ["╫", "╪"] },
  toggle: { interval: 250, frames: ["⊶", "⊷"] },
  toggle2: { interval: 80, frames: ["▫", "▪"] },
  toggle3: { interval: 120, frames: ["□", "■"] },
  toggle4: { interval: 100, frames: ["■", "□", "▪", "▫"] },
  toggle5: { interval: 100, frames: ["▮", "▯"] },
  toggle6: { interval: 300, frames: ["ဝ", "၀"] },
  toggle7: { interval: 80, frames: ["⦾", "⦿"] },
  toggle8: { interval: 100, frames: ["◍", "◌"] },
  toggle9: { interval: 100, frames: ["◉", "◎"] },
  toggle10: { interval: 100, frames: ["㊂", "㊀", "㊁"] },
  toggle11: { interval: 50, frames: ["⧇", "⧆"] },
  toggle12: { interval: 120, frames: ["☗", "☖"] },
  toggle13: { interval: 80, frames: ["=", "*", "-"] },
  arrow: { interval: 100, frames: ["←", "↖", "↑", "↗", "→", "↘", "↓", "↙"] },
  arrow2: {
    interval: 80,
    frames: ["⬆️ ", "↗️ ", "➡️ ", "↘️ ", "⬇️ ", "↙️ ", "⬅️ ", "↖️ "]
  },
  arrow3: {
    interval: 120,
    frames: ["▹▹▹▹▹", "▸▹▹▹▹", "▹▸▹▹▹", "▹▹▸▹▹", "▹▹▹▸▹", "▹▹▹▹▸"]
  },
  bouncingBar: {
    interval: 80,
    frames: [
      "[    ]",
      "[=   ]",
      "[==  ]",
      "[=== ]",
      "[====]",
      "[ ===]",
      "[  ==]",
      "[   =]",
      "[    ]",
      "[   =]",
      "[  ==]",
      "[ ===]",
      "[====]",
      "[=== ]",
      "[==  ]",
      "[=   ]"
    ]
  },
  bouncingBall: {
    interval: 80,
    frames: [
      "( ●    )",
      "(  ●   )",
      "(   ●  )",
      "(    ● )",
      "(     ●)",
      "(    ● )",
      "(   ●  )",
      "(  ●   )",
      "( ●    )",
      "(●     )"
    ]
  },
  smiley: { interval: 200, frames: ["😄 ", "😝 "] },
  monkey: { interval: 300, frames: ["🙈 ", "🙈 ", "🙉 ", "🙊 "] },
  hearts: { interval: 100, frames: ["💛 ", "💙 ", "💜 ", "💚 ", "💗 "] },
  clock: {
    interval: 100,
    frames: [
      "🕛 ",
      "🕐 ",
      "🕑 ",
      "🕒 ",
      "🕓 ",
      "🕔 ",
      "🕕 ",
      "🕖 ",
      "🕗 ",
      "🕘 ",
      "🕙 ",
      "🕚 "
    ]
  },
  earth: { interval: 180, frames: ["🌍 ", "🌎 ", "🌏 "] },
  material: {
    interval: 17,
    frames: [
      "█▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
      "██▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
      "███▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
      "████▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
      "██████▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
      "██████▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
      "███████▁▁▁▁▁▁▁▁▁▁▁▁▁",
      "████████▁▁▁▁▁▁▁▁▁▁▁▁",
      "█████████▁▁▁▁▁▁▁▁▁▁▁",
      "█████████▁▁▁▁▁▁▁▁▁▁▁",
      "██████████▁▁▁▁▁▁▁▁▁▁",
      "███████████▁▁▁▁▁▁▁▁▁",
      "█████████████▁▁▁▁▁▁▁",
      "██████████████▁▁▁▁▁▁",
      "██████████████▁▁▁▁▁▁",
      "▁██████████████▁▁▁▁▁",
      "▁██████████████▁▁▁▁▁",
      "▁██████████████▁▁▁▁▁",
      "▁▁██████████████▁▁▁▁",
      "▁▁▁██████████████▁▁▁",
      "▁▁▁▁█████████████▁▁▁",
      "▁▁▁▁██████████████▁▁",
      "▁▁▁▁██████████████▁▁",
      "▁▁▁▁▁██████████████▁",
      "▁▁▁▁▁██████████████▁",
      "▁▁▁▁▁██████████████▁",
      "▁▁▁▁▁▁██████████████",
      "▁▁▁▁▁▁██████████████",
      "▁▁▁▁▁▁▁█████████████",
      "▁▁▁▁▁▁▁█████████████",
      "▁▁▁▁▁▁▁▁████████████",
      "▁▁▁▁▁▁▁▁████████████",
      "▁▁▁▁▁▁▁▁▁███████████",
      "▁▁▁▁▁▁▁▁▁███████████",
      "▁▁▁▁▁▁▁▁▁▁██████████",
      "▁▁▁▁▁▁▁▁▁▁██████████",
      "▁▁▁▁▁▁▁▁▁▁▁▁████████",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁███████",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁██████",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█████",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█████",
      "█▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁████",
      "██▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁███",
      "██▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁███",
      "███▁▁▁▁▁▁▁▁▁▁▁▁▁▁███",
      "████▁▁▁▁▁▁▁▁▁▁▁▁▁▁██",
      "█████▁▁▁▁▁▁▁▁▁▁▁▁▁▁█",
      "█████▁▁▁▁▁▁▁▁▁▁▁▁▁▁█",
      "██████▁▁▁▁▁▁▁▁▁▁▁▁▁█",
      "████████▁▁▁▁▁▁▁▁▁▁▁▁",
      "█████████▁▁▁▁▁▁▁▁▁▁▁",
      "█████████▁▁▁▁▁▁▁▁▁▁▁",
      "█████████▁▁▁▁▁▁▁▁▁▁▁",
      "█████████▁▁▁▁▁▁▁▁▁▁▁",
      "███████████▁▁▁▁▁▁▁▁▁",
      "████████████▁▁▁▁▁▁▁▁",
      "████████████▁▁▁▁▁▁▁▁",
      "██████████████▁▁▁▁▁▁",
      "██████████████▁▁▁▁▁▁",
      "▁██████████████▁▁▁▁▁",
      "▁██████████████▁▁▁▁▁",
      "▁▁▁█████████████▁▁▁▁",
      "▁▁▁▁▁████████████▁▁▁",
      "▁▁▁▁▁████████████▁▁▁",
      "▁▁▁▁▁▁███████████▁▁▁",
      "▁▁▁▁▁▁▁▁█████████▁▁▁",
      "▁▁▁▁▁▁▁▁█████████▁▁▁",
      "▁▁▁▁▁▁▁▁▁█████████▁▁",
      "▁▁▁▁▁▁▁▁▁█████████▁▁",
      "▁▁▁▁▁▁▁▁▁▁█████████▁",
      "▁▁▁▁▁▁▁▁▁▁▁████████▁",
      "▁▁▁▁▁▁▁▁▁▁▁████████▁",
      "▁▁▁▁▁▁▁▁▁▁▁▁███████▁",
      "▁▁▁▁▁▁▁▁▁▁▁▁███████▁",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁███████",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁███████",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█████",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁████",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁████",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁████",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁███",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁███",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁██",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁██",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁██",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁█",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁",
      "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁"
    ]
  },
  moon: {
    interval: 80,
    frames: ["🌑 ", "🌒 ", "🌓 ", "🌔 ", "🌕 ", "🌖 ", "🌗 ", "🌘 "]
  },
  runner: { interval: 140, frames: ["🚶 ", "🏃 "] },
  pong: {
    interval: 80,
    frames: [
      "▐⠂       ▌",
      "▐⠈       ▌",
      "▐ ⠂      ▌",
      "▐ ⠠      ▌",
      "▐  ⡀     ▌",
      "▐  ⠠     ▌",
      "▐   ⠂    ▌",
      "▐   ⠈    ▌",
      "▐    ⠂   ▌",
      "▐    ⠠   ▌",
      "▐     ⡀  ▌",
      "▐     ⠠  ▌",
      "▐      ⠂ ▌",
      "▐      ⠈ ▌",
      "▐       ⠂▌",
      "▐       ⠠▌",
      "▐       ⡀▌",
      "▐      ⠠ ▌",
      "▐      ⠂ ▌",
      "▐     ⠈  ▌",
      "▐     ⠂  ▌",
      "▐    ⠠   ▌",
      "▐    ⡀   ▌",
      "▐   ⠠    ▌",
      "▐   ⠂    ▌",
      "▐  ⠈     ▌",
      "▐  ⠂     ▌",
      "▐ ⠠      ▌",
      "▐ ⡀      ▌",
      "▐⠠       ▌"
    ]
  },
  shark: {
    interval: 120,
    frames: [
      "▐|\\____________▌",
      "▐_|\\___________▌",
      "▐__|\\__________▌",
      "▐___|\\_________▌",
      "▐____|\\________▌",
      "▐_____|\\_______▌",
      "▐______|\\______▌",
      "▐_______|\\_____▌",
      "▐________|\\____▌",
      "▐_________|\\___▌",
      "▐__________|\\__▌",
      "▐___________|\\_▌",
      "▐____________|\\▌",
      "▐____________/|▌",
      "▐___________/|_▌",
      "▐__________/|__▌",
      "▐_________/|___▌",
      "▐________/|____▌",
      "▐_______/|_____▌",
      "▐______/|______▌",
      "▐_____/|_______▌",
      "▐____/|________▌",
      "▐___/|_________▌",
      "▐__/|__________▌",
      "▐_/|___________▌",
      "▐/|____________▌"
    ]
  },
  dqpb: { interval: 100, frames: ["d", "q", "p", "b"] },
  weather: {
    interval: 100,
    frames: [
      "☀️ ",
      "☀️ ",
      "☀️ ",
      "🌤 ",
      "⛅️ ",
      "🌥 ",
      "☁️ ",
      "🌧 ",
      "🌨 ",
      "🌧 ",
      "🌨 ",
      "🌧 ",
      "🌨 ",
      "⛈ ",
      "🌨 ",
      "🌧 ",
      "🌨 ",
      "☁️ ",
      "🌥 ",
      "⛅️ ",
      "🌤 ",
      "☀️ ",
      "☀️ "
    ]
  },
  christmas: { interval: 400, frames: ["🌲", "🎄"] },
  grenade: {
    interval: 80,
    frames: [
      "،  ",
      "′  ",
      " ´ ",
      " ‾ ",
      "  ⸌",
      "  ⸊",
      "  |",
      "  ⁎",
      "  ⁕",
      " ෴ ",
      "  ⁓",
      "   ",
      "   ",
      "   "
    ]
  },
  point: { interval: 125, frames: ["∙∙∙", "●∙∙", "∙●∙", "∙∙●", "∙∙∙"] },
  layer: { interval: 150, frames: ["-", "=", "≡"] },
  betaWave: {
    interval: 80,
    frames: [
      "ρββββββ",
      "βρβββββ",
      "ββρββββ",
      "βββρβββ",
      "ββββρββ",
      "βββββρβ",
      "ββββββρ"
    ]
  },
  fingerDance: {
    interval: 160,
    frames: ["🤘 ", "🤟 ", "🖖 ", "✋ ", "🤚 ", "👆 "]
  },
  fistBump: {
    interval: 80,
    frames: [
      "🤜\u3000\u3000\u3000\u3000🤛 ",
      "🤜\u3000\u3000\u3000\u3000🤛 ",
      "🤜\u3000\u3000\u3000\u3000🤛 ",
      "\u3000🤜\u3000\u3000🤛\u3000 ",
      "\u3000\u3000🤜🤛\u3000\u3000 ",
      "\u3000🤜✨🤛\u3000\u3000 ",
      "🤜\u3000✨\u3000🤛\u3000 "
    ]
  },
  soccerHeader: {
    interval: 80,
    frames: [
      " 🧑⚽️       🧑 ",
      "🧑  ⚽️      🧑 ",
      "🧑   ⚽️     🧑 ",
      "🧑    ⚽️    🧑 ",
      "🧑     ⚽️   🧑 ",
      "🧑      ⚽️  🧑 ",
      "🧑       ⚽️🧑  ",
      "🧑      ⚽️  🧑 ",
      "🧑     ⚽️   🧑 ",
      "🧑    ⚽️    🧑 ",
      "🧑   ⚽️     🧑 ",
      "🧑  ⚽️      🧑 "
    ]
  },
  mindblown: {
    interval: 160,
    frames: [
      "😐 ",
      "😐 ",
      "😮 ",
      "😮 ",
      "😦 ",
      "😦 ",
      "😧 ",
      "😧 ",
      "🤯 ",
      "💥 ",
      "✨ ",
      "\u3000 ",
      "\u3000 ",
      "\u3000 "
    ]
  },
  speaker: { interval: 160, frames: ["🔈 ", "🔉 ", "🔊 ", "🔉 "] },
  orangePulse: { interval: 100, frames: ["🔸 ", "🔶 ", "🟠 ", "🟠 ", "🔶 "] },
  bluePulse: { interval: 100, frames: ["🔹 ", "🔷 ", "🔵 ", "🔵 ", "🔷 "] },
  orangeBluePulse: {
    interval: 100,
    frames: [
      "🔸 ",
      "🔶 ",
      "🟠 ",
      "🟠 ",
      "🔶 ",
      "🔹 ",
      "🔷 ",
      "🔵 ",
      "🔵 ",
      "🔷 "
    ]
  },
  timeTravel: {
    interval: 100,
    frames: [
      "🕛 ",
      "🕚 ",
      "🕙 ",
      "🕘 ",
      "🕗 ",
      "🕖 ",
      "🕕 ",
      "🕔 ",
      "🕓 ",
      "🕒 ",
      "🕑 ",
      "🕐 "
    ]
  },
  aesthetic: {
    interval: 80,
    frames: [
      "▰▱▱▱▱▱▱",
      "▰▰▱▱▱▱▱",
      "▰▰▰▱▱▱▱",
      "▰▰▰▰▱▱▱",
      "▰▰▰▰▰▱▱",
      "▰▰▰▰▰▰▱",
      "▰▰▰▰▰▰▰",
      "▰▱▱▱▱▱▱"
    ]
  },
  dwarfFortress: {
    interval: 80,
    frames: [
      " ██████£££  ",
      "☺██████£££  ",
      "☺██████£££  ",
      "☺▓█████£££  ",
      "☺▓█████£££  ",
      "☺▒█████£££  ",
      "☺▒█████£££  ",
      "☺░█████£££  ",
      "☺░█████£££  ",
      "☺ █████£££  ",
      " ☺█████£££  ",
      " ☺█████£££  ",
      " ☺▓████£££  ",
      " ☺▓████£££  ",
      " ☺▒████£££  ",
      " ☺▒████£££  ",
      " ☺░████£££  ",
      " ☺░████£££  ",
      " ☺ ████£££  ",
      "  ☺████£££  ",
      "  ☺████£££  ",
      "  ☺▓███£££  ",
      "  ☺▓███£££  ",
      "  ☺▒███£££  ",
      "  ☺▒███£££  ",
      "  ☺░███£££  ",
      "  ☺░███£££  ",
      "  ☺ ███£££  ",
      "   ☺███£££  ",
      "   ☺███£££  ",
      "   ☺▓██£££  ",
      "   ☺▓██£££  ",
      "   ☺▒██£££  ",
      "   ☺▒██£££  ",
      "   ☺░██£££  ",
      "   ☺░██£££  ",
      "   ☺ ██£££  ",
      "    ☺██£££  ",
      "    ☺██£££  ",
      "    ☺▓█£££  ",
      "    ☺▓█£££  ",
      "    ☺▒█£££  ",
      "    ☺▒█£££  ",
      "    ☺░█£££  ",
      "    ☺░█£££  ",
      "    ☺ █£££  ",
      "     ☺█£££  ",
      "     ☺█£££  ",
      "     ☺▓£££  ",
      "     ☺▓£££  ",
      "     ☺▒£££  ",
      "     ☺▒£££  ",
      "     ☺░£££  ",
      "     ☺░£££  ",
      "     ☺ £££  ",
      "      ☺£££  ",
      "      ☺£££  ",
      "      ☺▓££  ",
      "      ☺▓££  ",
      "      ☺▒££  ",
      "      ☺▒££  ",
      "      ☺░££  ",
      "      ☺░££  ",
      "      ☺ ££  ",
      "       ☺££  ",
      "       ☺££  ",
      "       ☺▓£  ",
      "       ☺▓£  ",
      "       ☺▒£  ",
      "       ☺▒£  ",
      "       ☺░£  ",
      "       ☺░£  ",
      "       ☺ £  ",
      "        ☺£  ",
      "        ☺£  ",
      "        ☺▓  ",
      "        ☺▓  ",
      "        ☺▒  ",
      "        ☺▒  ",
      "        ☺░  ",
      "        ☺░  ",
      "        ☺   ",
      "        ☺  &",
      "        ☺ ☼&",
      "       ☺ ☼ &",
      "       ☺☼  &",
      "      ☺☼  & ",
      "      ‼   & ",
      "     ☺   &  ",
      "    ‼    &  ",
      "   ☺    &   ",
      "  ‼     &   ",
      " ☺     &    ",
      "‼      &    ",
      "      &     ",
      "      &     ",
      "     &   ░  ",
      "     &   ▒  ",
      "    &    ▓  ",
      "    &    £  ",
      "   &    ░£  ",
      "   &    ▒£  ",
      "  &     ▓£  ",
      "  &     ££  ",
      " &     ░££  ",
      " &     ▒££  ",
      "&      ▓££  ",
      "&      £££  ",
      "      ░£££  ",
      "      ▒£££  ",
      "      ▓£££  ",
      "      █£££  ",
      "     ░█£££  ",
      "     ▒█£££  ",
      "     ▓█£££  ",
      "     ██£££  ",
      "    ░██£££  ",
      "    ▒██£££  ",
      "    ▓██£££  ",
      "    ███£££  ",
      "   ░███£££  ",
      "   ▒███£££  ",
      "   ▓███£££  ",
      "   ████£££  ",
      "  ░████£££  ",
      "  ▒████£££  ",
      "  ▓████£££  ",
      "  █████£££  ",
      " ░█████£££  ",
      " ▒█████£££  ",
      " ▓█████£££  ",
      " ██████£££  ",
      " ██████£££  "
    ]
  },
  fish: {
    interval: 80,
    frames: [
      "~~~~~~~~~~~~~~~~~~~~",
      "> ~~~~~~~~~~~~~~~~~~",
      "º> ~~~~~~~~~~~~~~~~~",
      "(º> ~~~~~~~~~~~~~~~~",
      "((º> ~~~~~~~~~~~~~~~",
      "<((º> ~~~~~~~~~~~~~~",
      "><((º> ~~~~~~~~~~~~~",
      " ><((º> ~~~~~~~~~~~~",
      "~ ><((º> ~~~~~~~~~~~",
      "~~ <>((º> ~~~~~~~~~~",
      "~~~ ><((º> ~~~~~~~~~",
      "~~~~ <>((º> ~~~~~~~~",
      "~~~~~ ><((º> ~~~~~~~",
      "~~~~~~ <>((º> ~~~~~~",
      "~~~~~~~ ><((º> ~~~~~",
      "~~~~~~~~ <>((º> ~~~~",
      "~~~~~~~~~ ><((º> ~~~",
      "~~~~~~~~~~ <>((º> ~~",
      "~~~~~~~~~~~ ><((º> ~",
      "~~~~~~~~~~~~ <>((º> ",
      "~~~~~~~~~~~~~ ><((º>",
      "~~~~~~~~~~~~~~ <>((º",
      "~~~~~~~~~~~~~~~ ><((",
      "~~~~~~~~~~~~~~~~ <>(",
      "~~~~~~~~~~~~~~~~~ ><",
      "~~~~~~~~~~~~~~~~~~ <",
      "~~~~~~~~~~~~~~~~~~~~"
    ]
  }
};

export default spinners;

// Per-item constants
export const dots = spinners.dots;
export const dots2 = spinners.dots2;
export const dots3 = spinners.dots3;
export const dots4 = spinners.dots4;
export const dots5 = spinners.dots5;
export const dots6 = spinners.dots6;
export const dots7 = spinners.dots7;
export const dots8 = spinners.dots8;
export const dots9 = spinners.dots9;
export const dots10 = spinners.dots10;
export const dots11 = spinners.dots11;
export const dots12 = spinners.dots12;
export const dots13 = spinners.dots13;
export const dots14 = spinners.dots14;
export const dots8Bit = spinners.dots8Bit;
export const dotsCircle = spinners.dotsCircle;
export const sand = spinners.sand;
export const line = spinners.line;
export const line2 = spinners.line2;
export const rollingLine = spinners.rollingLine;
export const pipe = spinners.pipe;
export const simpleDots = spinners.simpleDots;
export const simpleDotsScrolling = spinners.simpleDotsScrolling;
export const star = spinners.star;
export const star2 = spinners.star2;
export const flip = spinners.flip;
export const hamburger = spinners.hamburger;
export const growVertical = spinners.growVertical;
export const growHorizontal = spinners.growHorizontal;
export const balloon = spinners.balloon;
export const balloon2 = spinners.balloon2;
export const noise = spinners.noise;
export const bounce = spinners.bounce;
export const boxBounce = spinners.boxBounce;
export const boxBounce2 = spinners.boxBounce2;
export const triangle = spinners.triangle;
export const binary = spinners.binary;
export const arc = spinners.arc;
export const circle = spinners.circle;
export const squareCorners = spinners.squareCorners;
export const circleQuarters = spinners.circleQuarters;
export const circleHalves = spinners.circleHalves;
export const squish = spinners.squish;
export const toggle = spinners.toggle;
export const toggle2 = spinners.toggle2;
export const toggle3 = spinners.toggle3;
export const toggle4 = spinners.toggle4;
export const toggle5 = spinners.toggle5;
export const toggle6 = spinners.toggle6;
export const toggle7 = spinners.toggle7;
export const toggle8 = spinners.toggle8;
export const toggle9 = spinners.toggle9;
export const toggle10 = spinners.toggle10;
export const toggle11 = spinners.toggle11;
export const toggle12 = spinners.toggle12;
export const toggle13 = spinners.toggle13;
export const arrow = spinners.arrow;
export const arrow2 = spinners.arrow2;
export const arrow3 = spinners.arrow3;
export const bouncingBar = spinners.bouncingBar;
export const bouncingBall = spinners.bouncingBall;
export const smiley = spinners.smiley;
export const monkey = spinners.monkey;
export const hearts = spinners.hearts;
export const clock = spinners.clock;
export const earth = spinners.earth;
export const material = spinners.material;
export const moon = spinners.moon;
export const runner = spinners.runner;
export const pong = spinners.pong;
export const shark = spinners.shark;
export const dqpb = spinners.dqpb;
export const weather = spinners.weather;
export const christmas = spinners.christmas;
export const grenade = spinners.grenade;
export const point = spinners.point;
export const layer = spinners.layer;
export const betaWave = spinners.betaWave;
export const fingerDance = spinners.fingerDance;
export const fistBump = spinners.fistBump;
export const soccerHeader = spinners.soccerHeader;
export const mindblown = spinners.mindblown;
export const speaker = spinners.speaker;
export const orangePulse = spinners.orangePulse;
export const bluePulse = spinners.bluePulse;
export const orangeBluePulse = spinners.orangeBluePulse;
export const timeTravel = spinners.timeTravel;
export const aesthetic = spinners.aesthetic;
export const dwarfFortress = spinners.dwarfFortress;
export const fish = spinners.fish;

export type SpinnerPresetConfigs = typeof spinners;

export type SpinnerPreset = keyof SpinnerPresetConfigs;

/**
 * Applies the specified spinner preset and returns the corresponding spinner configuration.
 *
 * @param identifier - The spinner preset identifier.
 * @returns The spinner configuration with the corresponding characters.
 */
export function resolveSpinner<T extends SpinnerPreset>(
  identifier: T
): SpinnerPresetConfigs[T] {
  return spinners[identifier];
}
